// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

Console.Write("Input number: ");
int N = Convert.ToInt32(Console.ReadLine());
var numbers = new int[]{ 1,N };
var list = numbers.ToList(1,N);
if(N % 2);
Console.Write("All even numbers: ");


